Revit 2027 API
BuiltInFailures.MatchlineFailures.CreationFailed Property
 Matchline top extent should be higher than its bottom.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CreationFailed { get; }
Public Shared ReadOnly Property CreationFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CreationFailed {
	FailureDefinitionId^ get ();
}
static member CreationFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MatchlineFailures Class
Autodesk.Revit.DB Namespace